Calc only has an interactive shell and cannot load files.
Here is a record of an interactive session.

calc_var -- programming languages zoo
Type Ctrl-D to exit
calc_var> 2+2
4
calc_var> x=10
calc_var> y=x+20
calc_var> 3 * x + 7
37
calc_var> z
Error: unknown variable z
calc_var> x=20
calc_var> x + y
50
calc_var> x / 0
Error: division by zero
